УТ_для_edt.РасширениеСмарт/src/Documents/CRM_Интерес/CRM_Интерес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="afa0c775-67d2-41ec-9aa6-6ac947dfbdc6">
  <name>CRM_Интерес</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Заметки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТекстСодержания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Пометка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДляРабочегоСтола</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗаметки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПредставлениеПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9cca9751-c599-4906-ad10-d4c17fd84503">
    <name>смартКвалификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/CRM_Интерес/Forms/ФормаСписка/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&НаСервере
&ИзменениеИКонтроль("ПриСозданииНаСервере")
Процедура смарт_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// +Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.
	Если НЕ CRM_РежимФормЗакладкиСервер.ВосстановлениеФормыПриЗапускеСеанса(ЭтотОбъект, Отказ, СтандартнаяОбработка) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// -Этот блок обязательно должен быть в самом начале процедуры, чтобы при отказе не выполнять избыточный код.

	МодульУправлениеДоступом = CRM_ОбщегоНазначенияСервер.ОбщийМодуль("CRM_УправлениеДоступом");
	Если МодульУправлениеДоступом <> Неопределено Тогда
		МодульУправлениеДоступом.ОграничитьВыводКлиентскойБазы(ЭтотОбъект, "Список");
	КонецЕсли;

	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВерсионированиеОбъектов") Тогда
		МодульВерсионированиеОбъектов = ОбщегоНазначения.ОбщийМодуль("ВерсионированиеОбъектов");
		МодульВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКоманды = ОбщегоНазначения.ОбщийМодуль("ПодключаемыеКоманды");
		МодульПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	CRM_ОбщегоНазначенияСервер.УдалитьЭлементОтбораСписка(Список, "Партнер");

	ОтборЗавершен = "Все";

	Если Параметры.Свойство("РежимВыбора") Тогда
		Элементы.Список.РежимВыбора			= Параметры.РежимВыбора;
	КонецЕсли;

	Если Параметры.Свойство("ЗакрыватьПриВыборе") И НЕ (Параметры.ЗакрыватьПриВыборе = Неопределено) Тогда
		ЗакрыватьПриВыборе			= Параметры.ЗакрыватьПриВыборе;
	КонецЕсли;

	Если Параметры.Свойство("МножественныйВыбор") И НЕ (Параметры.МножественныйВыбор = Неопределено) Тогда
		Элементы.Список.МножественныйВыбор	= Параметры.МножественныйВыбор;
	КонецЕсли;

	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("Партнер") Тогда
		Если ТипЗнч(Параметры.Отбор.Партнер) = Тип("СписокЗначений") Тогда
			ОтборКонтрагент = Параметры.Отбор.Партнер[0].Значение;
		Иначе
			ОтборКонтрагент = Параметры.Отбор.Партнер;
		КонецЕсли;

		Если Параметры.Отбор.Свойство("КонтактноеЛицо") Тогда
			КонтактноеЛицоОтбор = Параметры.Отбор.КонтактноеЛицо;
		КонецЕсли;

	КонецЕсли;

	ТипОбращенияИнтерес = Справочники.CRM_ТипыОбращений.Интерес;

	ТолькоОбращенияПоддержки = Ложь;
	Если Параметры.Свойство("ТолькоОбращенияПоддержки") И Параметры.ТолькоОбращенияПоддержки Тогда
		ТолькоОбращенияПоддержки = Истина;
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
		"ТипОбращения",
		ТипОбращенияИнтерес,
		ВидСравненияКомпоновкиДанных.НеРавно,,
		Истина,
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
		Элементы.ОтборТипОбращения.РежимВыбораИзСписка = Истина;
		ДанныеВыбора = Справочники.CRM_ТипыОбращений.ПолучитьДанныеВыбора(Новый Структура);
		Для Каждого ЭлементДанных Из ДанныеВыбора Цикл
			Если ЭлементДанных.Значение = ТипОбращенияИнтерес Тогда
				Продолжить;
			КонецЕсли;
			НовыйЭлемент = Элементы.ОтборТипОбращения.СписокВыбора.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйЭлемент, ЭлементДанных);
		КонецЦикла;

	КонецЕсли;

	CRM_Теги.ОбновитьЗначенияОтбораПериодов(ЭтотОбъект);

	Если НЕ ПолучитьФункциональнуюОпцию("CRM_ИспользоватьТеги") Тогда
		Элементы.ОтборТеги.Видимость = Ложь;
		Элементы.ЗначенияОтбораТеги.Видимость = Ложь;
	Иначе
		ОтборПодразделениеДляТегов = Пользователи.АвторизованныйПользователь().Подразделение;
		СписокВышестоящихПодразделений.ЗагрузитьЗначения(CRM_МетодыМодулейМенеджеровСправочников.ПолучитьВсеПодразделенияРодители(ОтборПодразделениеДляТегов, Истина));

		ОбновитьЗначенияОтбораТегов();
	КонецЕсли; 
	ОтбиратьОбъектыБезТегов = Ложь;

	Если Параметры.Свойство("ЭтоВыборИнтереса") И Параметры.ЭтоВыборИнтереса Тогда
		ЭтоВыборИнтереса = Истина;
	Иначе
		ОтборПользователь = Пользователи.АвторизованныйПользователь();
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ответственный", ОтборПользователь, Истина);
	КонецЕсли;

	Если Не CRM_ОбщегоНазначенияПовтИсп.ЭтоCRM() Тогда
		Если CRM_ОбщегоНазначенияСервер.НайтиВМетаданныхПоИмени("Документы", "ЗаказКлиента") Тогда
			Элементы.ФормаДокументCRM_СчетНаОплатуПокупателюСоздатьНаОсновании.Заголовок = "Заказ клиента";
		Иначе
			Элементы.ФормаДокументCRM_СчетНаОплатуПокупателюСоздатьНаОсновании.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	Если Элементы.Найти("ФормаОбщаяКомандаCRM_СоздатьЛичнуюЗадачу") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаCRM_СоздатьЛичнуюЗадачу.ОтображениеПодсказки = ОтображениеПодсказки.Нет;
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("CRM_ИспользоватьПоддержку") Тогда

		ИнтересыКакПродажа = Ложь;
		ТипОбращенияПереданКакОтбор = Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ТипОбращения");
		Если НЕ ТолькоОбращенияПоддержки И ТипОбращенияПереданКакОтбор Тогда
			Если Параметры.Отбор.ТипОбращения = Справочники.CRM_ТипыОбращений.Интерес Тогда
				ИнтересыКакПродажа = Истина;
			КонецЕсли;
		КонецЕсли;

		Если Не ИнтересыКакПродажа Тогда

			АвтоЗаголовок = Ложь;
			Если ТолькоОбращенияПоддержки Тогда
				Заголовок = НСтр("ru = 'Обращения в поддержку'");
			Иначе
				Заголовок = НСтр("ru = 'Интересы клиентов и обращения в поддержку'");
			КонецЕсли;

			Элементы.ТипОбращения.Видимость = Истина;

			Элементы.ОтборТипОбращения.Видимость = Истина;
			Если ТипОбращенияПереданКакОтбор Тогда
				ОтборТипОбращения = Параметры.Отбор.ТипОбращения;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "ТекущаяДата", ТекущаяДатаСеанса());
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список, "Календарь",
	Константы.ОсновнойКалендарьПредприятия.Получить());

	ИспользоватьКоммерческиеПредложенияКлиентам = ПолучитьФункциональнуюОпцию("ИспользоватьКоммерческиеПредложенияКлиентам");
	Если Не ИспользоватьКоммерческиеПредложенияКлиентам Тогда
		Элементы.ФормаДокументКоммерческоеПредложениеКлиентуСоздатьНаОсновании.Видимость = ИспользоватьКоммерческиеПредложенияКлиентам;
	КонецЕсли;

	CRM_ОбщегоНазначенияСервер.УстановитьКнопкиПечати(Список.ОсновнаяТаблица, ЭтотОбъект);

	// +Рабочий стол
	CRM_СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	// -Рабочий стол

	#Вставка
	//++ #Б3960 смарт: Шляпников 16.09.2025 / Добавление признака VIP клиента во все документы и в карточку партнера
	смартОбщегоНазначения.СоздатьЭлементыПризнакаVIPКлиентаНаФормеСписка(ЭтаФорма,
																		 "ДокументCRM_Интерес", 
																		 "Документ.CRM_Интерес КАК ДокументCRM_Интерес", 
																		 "ДокументCRM_Интерес.Ссылка КАК Ссылка,",
																		 "Список",
																		 ,
																		 Ложь,
																		 "Клиент");
	//-- #Б3960 смарт: Шляпников 16.09.2025
	#КонецВставки
	
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СписокПриАктивизацииСтроки")
//++ #Б-976 смарт: Фролов 22.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключитьОбработчикОжидания("ОбработатьАктивизациюСтрокиСписка", 0.2, Истина);
	
	#Вставка
	//++ #1443 смарт: Фролов 01.09.2023 //Добработать Интерес, чтобы было видно заметки по клиенту и возможность создать заметку по клиенту.  
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Партнер=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ТекущиеДанные.Ссылка,"Партнер");
		СсылкаПартнер = ?(ЗначениеЗаполнено(Партнер), Партнер, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		
		смартЗаполнитьТаблицуЗаметок(СсылкаПартнер, ?(ЭтаФорма.смартТолькоМоиЗаметки, ПользователиКлиент.ТекущийПользователь(), Неопределено));
	КонецЕсли;
	//-- #1443 смарт: Фролов 01.09.2023
	#КонецВставки

КонецПроцедуры //-- #Б-976 смарт: Фролов 22.10.2024

&НаКлиенте
&ИзменениеИКонтроль("ОтборЗавершенПриИзменении")
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ОтборЗавершенПриИзменении(Элемент)
	Если ОтборЗавершен = "Завершенные" Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Завершен", Истина, Истина, ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ОтборЗавершен = "Незавершенные" Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Завершен", Ложь, Истина, ВидСравненияКомпоновкиДанных.Равно);
	Иначе
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Завершен");
	КонецЕсли;
	ОтборПоЗавершенности = ?(ОтборЗавершен = "Все", "", ОтборЗавершен);
	CRM_ТегиКлиент.БыстрыйОтборИзменение(ЭтотОбъект, ОтборПоЗавершенности, ОтборКонтрагент, ОтборПользователь, ОтборПроект, ОтборТипОбращения);
	
	#Вставка
	//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
	смартБыстрыйОтборИзменение();

	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	//-- #1910 смарт: Лопато 07.08.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаКлиенте
&ИзменениеИКонтроль("ОтборКонтрагентПриИзменении")
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ОтборКонтрагентПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Партнер", ОтборКонтрагент, Истина);
	Иначе	
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Партнер");
	КонецЕсли;
	ОтборПоЗавершенности = ?(ОтборЗавершен = "Все", "", ОтборЗавершен);
	CRM_ТегиКлиент.БыстрыйОтборИзменение(ЭтотОбъект, ОтборПоЗавершенности, ОтборКонтрагент, ОтборПользователь, ОтборПроект, ОтборТипОбращения);
	
	#Вставка
	//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
	смартБыстрыйОтборИзменение();

	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	//-- #1910 смарт: Лопато 07.08.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаКлиенте
&ИзменениеИКонтроль("ОтборПользовательПриИзменении")
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ОтборПользовательПриИзменении(Элемент)
	Если ЗначениеЗаполнено(ОтборПользователь) Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ответственный", ОтборПользователь, Истина);
	Иначе	
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ответственный");			
	КонецЕсли;
	ОтборПоЗавершенности = ?(ОтборЗавершен = "Все", "", ОтборЗавершен);
	CRM_ТегиКлиент.БыстрыйОтборИзменение(ЭтотОбъект, ОтборПоЗавершенности, ОтборКонтрагент, ОтборПользователь, ОтборПроект, ОтборТипОбращения);
	
	#Вставка
	//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
	смартБыстрыйОтборИзменение();

	СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	//-- #1910 смарт: Лопато 07.08.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаКлиенте
&ИзменениеИКонтроль("ПриОткрытии")
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ПриОткрытии(Отказ)
	
	Если ЭтоВыборИнтереса Тогда
		ОтборЗавершен = "Незавершенные";
		ОтборЗавершенПриИзменении(Неопределено);
	КонецЕсли;
		
	// Перейдем сразу на вкладку отборов "Быстрые отборы" и оставим ее в свернутом режиме.
	Элементы.ПанельЗначенийОтбора.Видимость			= Истина;
	Элементы.ПанельЗначенийОтбора.ТекущаяСтраница	= Элементы.ЗначенияОтбораБыстрыеОтборы;
	БыстрыеОтборы(Элементы.БыстрыеОтборы);
	ОтборПоЗавершенности = ?(ОтборЗавершен = "Все", "", ОтборЗавершен);
	CRM_ТегиКлиент.БыстрыйОтборИзменение(ЭтотОбъект, ОтборПоЗавершенности, ОтборКонтрагент, ОтборПользователь, ОтборПроект, ОтборТипОбращения);
	
	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Партнер", ОтборКонтрагент, Истина);
	Иначе	
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Партнер");
	КонецЕсли;
	
	#Вставка
	//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
	смартУстановитьОтборы();

	смартБыстрыйОтборИзменение();
	//-- #1910 смарт: Лопато 07.08.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаСервере
&ИзменениеИКонтроль("ПриСохраненииДанныхВНастройкахНаСервере")
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	Настройки.Вставить("ПометкаПоказатьСкрытьДопИнформацию", ПометкаПоказатьСкрытьДопИнформацию);	
	
	#Вставка
	//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
	смартСохранитьРеквизитыФормы(Настройки);
	//-- #1910 смарт: Лопато 07.08.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаСервере
&ИзменениеИКонтроль("ПриЗагрузкеДанныхИзНастроекНаСервере")
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ОтборЗавершен = Настройки.Получить("ОтборЗавершен");
	Если ОтборЗавершен = "Завершенные" Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Завершен", Истина, Истина, ВидСравненияКомпоновкиДанных.Равно);
	ИначеЕсли ОтборЗавершен = "Незавершенные" Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Завершен", Ложь, Истина, ВидСравненияКомпоновкиДанных.Равно);
	Иначе	
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Завершен");
	КонецЕсли;
	
	Если НЕ (Элементы.СписокСкрытьПоказатьПоИнтересам.Пометка = Элементы.ГруппаПанельИнформации.Видимость) Тогда
		Элементы.СписокСкрытьПоказатьПоИнтересам.Пометка = Элементы.ГруппаПанельИнформации.Видимость;
	КонецЕсли;		
	
	Если НЕ Настройки["ПометкаПоказатьСкрытьДопИнформацию"] = Неопределено Тогда
		ПометкаПоказатьСкрытьДопИнформацию	= Настройки["ПометкаПоказатьСкрытьДопИнформацию"];
	КонецЕсли;
	
	Элементы.СписокСкрытьПоказатьПоИнтересам.Пометка= ПометкаПоказатьСкрытьДопИнформацию;
	Элементы.ГруппаПанельИнформации.Видимость		= ПометкаПоказатьСкрытьДопИнформацию;
	
	#Вставка
	//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
	смартВосстановитьРеквизитыФормы(Настройки);
	//-- #1910 смарт: Лопато 07.08.2024
	#КонецВставки
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаКлиенте
&ИзменениеИКонтроль("ПередЗакрытием")
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смарт_ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	#Вставка
	//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
	Если ЭтотОбъект.ВладелецФормы <> Неопределено
		ИЛИ НЕ смартИспользоватьСохраненныеНастройки(ЭтотОбъект.Параметры) Тогда
		
		ЭтотОбъект.СохраняемыеВНастройкахДанныеМодифицированы = Ложь;
		
	КонецЕсли;	
	//-- #1910 смарт: Лопато 07.08.2024
	#КонецВставки

КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

#КонецОбласти

#Область ДоработкиСмарт

&НаСервере
//++ #Б-976 смарт: Фролов 22.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смартЗаполнитьТаблицуЗаметок(Партнер, Автор = Неопределено)

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Заметки.ДатаЗаметки КАК ДатаЗаметки,
	|	Заметки.Автор КАК Автор,
	|	Заметки.ТекстСодержания КАК Содержания,
	|	CRM_Интерес.Партнер КАК Предмет,
	|	Заметки.Ссылка КАК Ссылка,
	|	CRM_Интерес.Ссылка КАК Интерес
	|ИЗ
	|	Документ.CRM_Интерес КАК CRM_Интерес
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Заметки КАК Заметки
	|		ПО CRM_Интерес.Партнер = Заметки.Предмет
	|ГДЕ
	|	CRM_Интерес.Партнер = &Партнер
	|	И 1 = 1
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаЗаметки УБЫВ");
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Если НЕ Автор = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "Заметки.Автор = &Автор");
		Запрос.УстановитьПараметр("Автор", Автор);
	КонецЕсли;	
	
	ЭтаФорма.смартЗаметки.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 22.10.2024

&НаКлиенте
//++ #Б-976 смарт: Фролов 22.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смартЗаметкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элемент.ТекущиеДанные;
	ОткрытьФорму("Справочник.Заметки.ФормаОбъекта", Новый Структура("Ключ, ЗаметкаЛенты", ТекущиеДанные.Ссылка, Истина), ЭтаФорма);
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 22.10.2024

&НаКлиенте
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смартТолькоМоиЗаметкиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Партнер=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ТекущиеДанные.Ссылка,"Партнер");
		СсылкаПартнер = ?(ЗначениеЗаполнено(Партнер), Партнер, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		
		смартЗаполнитьТаблицуЗаметок(СсылкаПартнер, ?(ЭтаФорма.смартТолькоМоиЗаметки, ПользователиКлиент.ТекущийПользователь(), Неопределено)); 
		
	КонецЕсли;	
		
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаКлиенте
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура смартСоздатьЗаметку(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Партнер=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ТекущиеДанные.Ссылка,"Партнер");
		СсылкаПартнер = ?(ЗначениеЗаполнено(Партнер), Партнер, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		ОткрытьФорму("Справочник.Заметки.ФормаОбъекта", Новый Структура("Предмет, ЗаметкаЛенты", 
			СсылкаПартнер, Истина), ЭтаФорма, , , , Новый ОписаниеОповещения("ПослеСозданияНовойЗаметки", ЭтаФорма));
	КонецЕсли;
		
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

&НаКлиенте
//++ #Б-976 смарт: Фролов 23.10.2024 //Рефакторинг кода 1С. База УТ СМАРТ. Документы. CRM_Интерес
Процедура ПослеСозданияНовойЗаметки(Результат, ДопПараметры)Экспорт
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		
		Партнер=Б_ОбщиеПроцедурыИФункцииСервер.ПолучитьРеквизитОбъекта(ТекущиеДанные.Ссылка,"Партнер");
		СсылкаПартнер = ?(ЗначениеЗаполнено(Партнер), Партнер, ПредопределенноеЗначение("Справочник.Партнеры.ПустаяСсылка"));
		
		смартЗаполнитьТаблицуЗаметок(СсылкаПартнер, ?(ЭтаФорма.смартТолькоМоиЗаметки, ПользователиКлиент.ТекущийПользователь(), Неопределено)); 
		
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-976 смарт: Фролов 23.10.2024

//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
&НаСервере
Процедура смартСохранитьРеквизитыФормы(Настройки)

	Если смартИспользоватьСохраненныеНастройки(ЭтотОбъект.Параметры) Тогда

		МассивСохраняемыхРеквизитов = Новый Массив;
		
		МассивСохраняемыхРеквизитов.Добавить("смартКвалификация");
		МассивСохраняемыхРеквизитов.Добавить("смартНаблюдает");
		МассивСохраняемыхРеквизитов.Добавить("смартНаКонтроле");
		МассивСохраняемыхРеквизитов.Добавить("смартНовые");
		МассивСохраняемыхРеквизитов.Добавить("смартСтарые");
		МассивСохраняемыхРеквизитов.Добавить("смартТипУслуги");
		МассивСохраняемыхРеквизитов.Добавить("ОтборПользователь");
		МассивСохраняемыхРеквизитов.Добавить("ОтборКонтрагент");

		Для Каждого СохраняемыйРеквизит Из МассивСохраняемыхРеквизитов Цикл

			Если ТипЗнч(ЭтотОбъект[СохраняемыйРеквизит]) = Тип("СписокЗначений") Тогда
				Настройки.Вставить(СохраняемыйРеквизит, ЭтотОбъект[СохраняемыйРеквизит].ВыгрузитьЗначения());
			Иначе
				Настройки.Вставить(СохраняемыйРеквизит, ЭтотОбъект[СохраняемыйРеквизит]);
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;	

КонецПроцедуры //-- #1910 смарт: Лопато 07.08.2024

//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
&НаСервере
Процедура смартВосстановитьРеквизитыФормы(Настройки)

	Если смартИспользоватьСохраненныеНастройки(ЭтотОбъект.Параметры) Тогда

		МассивСохраняемыхРеквизитов = Новый Массив;
		
		МассивСохраняемыхРеквизитов.Добавить("смартКвалификация");
		МассивСохраняемыхРеквизитов.Добавить("смартНаКонтроле");
		МассивСохраняемыхРеквизитов.Добавить("смартНаблюдает");
		МассивСохраняемыхРеквизитов.Добавить("смартНовые");
		МассивСохраняемыхРеквизитов.Добавить("смартСтарые");
		МассивСохраняемыхРеквизитов.Добавить("смартТипУслуги");
		МассивСохраняемыхРеквизитов.Добавить("ОтборПользователь");
		МассивСохраняемыхРеквизитов.Добавить("ОтборКонтрагент");

		Для Каждого СохраняемыйРеквизит Из МассивСохраняемыхРеквизитов Цикл
			
			НастройкаСохраняемыйРеквизит = Настройки.Получить(СохраняемыйРеквизит);
			
			Если ТипЗнч(ЭтотОбъект[СохраняемыйРеквизит]) = Тип("СписокЗначений") Тогда
				
				Если ТипЗнч(НастройкаСохраняемыйРеквизит) = Тип("Массив") Тогда
					ЭтотОбъект[СохраняемыйРеквизит].ЗагрузитьЗначения(НастройкаСохраняемыйРеквизит);
				КонецЕсли;	
				
			Иначе

				ЭтотОбъект[СохраняемыйРеквизит] = НастройкаСохраняемыйРеквизит;
				
			КонецЕсли;	

		КонецЦикла;	
		
	Иначе

		ЭтотОбъект["смартНаблюдает"] 	= Неопределено;
		ЭтотОбъект["ОтборПользователь"] = Неопределено;
		
	КонецЕсли;	

КонецПроцедуры //-- #1910 смарт: Лопато 07.08.2024

//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
&НаКлиентеНаСервереБезКонтекста
Функция смартИспользоватьСохраненныеНастройки(Знач ПараметрыФормы)

	Возврат НЕ ((ПараметрыФормы.Свойство("Отбор") И ПараметрыФормы.Отбор.Свойство("Партнер"))
				 ИЛИ (ПараметрыФормы.Свойство("РежимВыбора") И ПараметрыФормы.РежимВыбора));
				
КонецФункции //-- #1910 смарт: Лопато 07.08.2024

//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
&НаКлиенте
Процедура смартУстановитьОтборы()
	
	Список.Параметры.УстановитьЗначениеПараметра("смартНаКонтроле", ЭтотОбъект.смартНаКонтроле);
	Список.Параметры.УстановитьЗначениеПараметра("смартНаблюдает",  ЭтотОбъект.смартНаблюдает);
	
	Если ЭтотОбъект.смартКвалификация.Количество() Тогда
		
		смартКвалификацияГруппаИли = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
										Список.Отбор,
										"смартКвалификацияГруппаИли",
										ТипГруппыЭлементовОтбораКомпоновкиДанных .ГруппаИли);
										
		смартКвалификацияГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
										смартКвалификацияГруппаИли,
										"смартКвалификацияГруппаИ",
										ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			смартКвалификацияГруппаИ,
			"смартИтоговаяКвалификация",
			Неопределено,
			ВидСравненияКомпоновкиДанных.НеЗаполнено, 
			"смартИтоговаяКвалификация_НеЗаполнено",
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			смартКвалификацияГруппаИ,
			"смартПредварительнаяКвалификация",
			ЭтотОбъект.смартКвалификация,
			ВидСравненияКомпоновкиДанных.ВСписке, 
			,
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);						
			
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
			смартКвалификацияГруппаИли,
			"смартИтоговаяКвалификация",
			ВидСравненияКомпоновкиДанных.ВСписке, 
			ЭтотОбъект.смартКвалификация,
			"смартИтоговаяКвалификация_ВСписке",
			Истина,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);								
			
	КонецЕсли;
	
	Если Не (ЭтотОбъект.смартНовые И ЭтотОбъект.смартСтарые)
		И (ЭтотОбъект.смартНовые Или ЭтотОбъект.смартСтарые) Тогда
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"смартВоронкаНовые",
			ЭтотОбъект.смартНовые,
			ВидСравненияКомпоновкиДанных.Равно, 
			,
			ЭтотОбъект.смартНовые,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,
			"смартВоронкаСтарые",
			ЭтотОбъект.смартСтарые,
			ВидСравненияКомпоновкиДанных.Равно, 
			,
			ЭтотОбъект.смартСтарые,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);

	КонецЕсли;

	Если ЭтотОбъект.смартТипУслуги.Количество() Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "ТипУслуги", ЭтотОбъект.смартТипУслуги, Истина, ВидСравненияКомпоновкиДанных.ВСписке);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Партнер", ОтборКонтрагент, Истина);
	Иначе	
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Партнер");
	КонецЕсли;

	Если ЗначениеЗаполнено(ОтборПользователь) Тогда
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ответственный", ОтборПользователь, Истина);
	Иначе	
		CRM_ОбщегоНазначенияКлиентСервер.ИзменитьЭлементОтбораСписка(Список, "Ответственный");
	КонецЕсли;
	
КонецПроцедуры //-- #1910 смарт: Лопато 07.08.2024

//++ #1910 смарт: Лопато 07.08.2024 //Сохранение настроек отбора списка интересов и их последующее применение при повторном входе в 1С.
&НаКлиенте
Процедура смартБыстрыйОтборИзменение()
	
	CRM_ТегиКлиент.БыстрыйОтборИзменение(
		ЭтотОбъект, 
		?(ОтборЗавершен = "Все", "", ОтборЗавершен), 
		ОтборКонтрагент, 
		ОтборПользователь, 
		ОтборПроект, 
		ОтборТипОбращения, 
		ЭтотОбъект.смартКвалификация,
		ЭтотОбъект.смартТипУслуги,
		?(ЭтотОбъект.смартНовые, Истина, ""), 
		?(ЭтотОбъект.смартСтарые, Истина, ""));
	
КонецПроцедуры //-- #1910 смарт: Лопато 07.08.2024

#КонецОбласти
